<img src="https://i.ibb.co/1MPXBQZ/ringodata-banner-v2.jpg" width="200"/>


---
-  Í∞ïÏùò Î∞è Ï∂îÍ∞Ä ÏûêÎ£å ÎßÅÌÅ¨
- Í∞ïÏùò ÎßÅÌÅ¨: [Python Í∞ïÏùò](#)

-  ÏÜåÏÖú ÎØ∏ÎîîÏñ¥ Î∞è Ïó∞ÎùΩÏ≤ò
  - Ï†ÄÏûê SNS: [instagram](https://www.instagram.com/ringo_data/?igsh=MTlrdW4xMzZvNTBtdw%3D%3D), [LinkedIn](https://www.linkedin.com/in/ringokwon/)
  - Ïù¥Î©îÏùº: ringo.data1@gmail.com

---

# Filtering
- pd.DataFrame ÏóêÏÑú Filtering ÏùÄ Ï°∞Í±¥Ïóê Î∂ÄÌï©(Boolean Í∞íÏù¥ True)ÌïòÎäî row Îßå ÎÇ®Í∏∞Îäî Í≥ºÏ†ï
```python
df[Ï°∞Í±¥]
# boolean-series:[True, False, ..., True]
```

In [1]:
# ÏòàÏãú
import pandas as pd

# ÏòàÏ†ú Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÏÉùÏÑ±
data = {
    'Name': ['Ï≤†Ïàò', 'ÏòÅÌù¨', 'Ìù•ÎØº', 'Î≤îÍ∑º'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago']
}

df = pd.DataFrame(data)

In [6]:
# df.Age >  30; age_over_30
con = df.Age > 30
print(con)
df.Age > 30

0    False
1    False
2     True
3     True
Name: Age, dtype: bool

0    False
1    False
2     True
3     True
Name: Age, dtype: bool

In [9]:
# filter result
# age_over_30 = df[df.Age > 30]
age_over_30 = df[con]
age_over_30

  Name  Age      City
2   Ìù•ÎØº   35  New York
3   Î≤îÍ∑º   40   Chicago

## between(), isin() , isna()
```python
#from_n Ïù¥ÏÉÅ, to_n Ïù¥Ìïò
df['col'].between(from_n,to_n)

# ÌäπÏ†ï Ïó¥(col)Ïùò Í∞íÏù¥ Ï£ºÏñ¥ÏßÑ Î™©Î°ù(['item1', 'item2'])Ïóê Ìè¨Ìï®ÎêòÏñ¥ ÏûàÎäîÏßÄ Ïó¨Î∂Ä
df['col'].isin(['item','item'])

# ÌäπÏ†ï Ïó¥(col)Ïùò Í∞íÏù¥ Í≤∞Ï∏°Ïπò(NA)Ïùº Í≤ΩÏö∞ True, ÏïÑÎãê Í≤ΩÏö∞ FalseÎ•º Î∞òÌôò
df['col'].isna()


```

In [24]:
#titannic btw age
import seaborn as sns
titanic = sns.load_dataset('titanic')

con = titanic.age.between(20,22)
sorted_df = pd.DataFrame(titanic[con])
sorted_df.sort_values('age', inplace=True)
sorted_df.reset_index(drop=True, inplace=True)
print(sorted_df.value_counts('age'))
sorted_df.head()

age
22.0    27
21.0    24
20.0    15
20.5     1
dtype: int64

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,20.0,0,0,9.2250,S,Third,man,True,NaN,Southampton,no,True
1,0,3,male,20.0,0,0,8.6625,S,Third,man,True,NaN,Southampton,no,True
2,1,3,male,20.0,1,1,15.7417,C,Third,man,True,NaN,Cherbourg,yes,False
3,1,3,male,20.0,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True
4,0,3,male,20.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True

In [25]:
#isin embarked
con = titanic.embarked.isin(['C','Q'])
sorted_df = pd.DataFrame(titanic[con])
sorted_df.reset_index(drop=True, inplace=True)
print(sorted_df.value_counts('embarked'))
sorted_df.head()

embarked
C    168
Q     77
dtype: int64

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
1,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
2,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
3,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
4,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True

In [30]:
#isna deck ~ ÏÇ¨Ïö©: Î∞òÎåÄÎ°ú
print(titanic.deck.value_counts(dropna=False))

con = titanic.deck.isna()
sorted_df = pd.DataFrame(titanic[con])
print(f"Í≤∞Ï∏°Ïπò Í∞úÏàò : ", len(sorted_df))
sorted_df.head()

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64
Í≤∞Ï∏°Ïπò Í∞úÏàò :  688

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False

In [31]:
# ~ ÏÇ¨Ïö© : Î∞òÎåÄÎ°ú Í≤∞Ï∏°ÏπòÍ∞Ä ÏïÑÎãå Îç∞Ïù¥ÌÑ∞Îßå Ï∂îÏ∂ú
con = titanic.deck.isna()
sorted_df = pd.DataFrame(titanic[~con])
print(f"Í≤∞Ï∏°Ïπò Í∞úÏàò : ", len(sorted_df))
sorted_df.head()

Í≤∞Ï∏°Ïπò Í∞úÏàò :  203

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

## and(&), or(|)
- Îëê Í∞ú Ïù¥ÏÉÅÏùò Ï°∞Í±¥ÏùÑ Í≤∞Ìï©
  - and: Î™®Îëê True -> True
  - or: ÌïòÎÇòÎùºÎèÑ True -> True

In [37]:
# True
# True or False
# True | False
# True and True
# True & True

# False
# True and False
# False or False

False

In [38]:
# ex age, deck
titanic['col1'] = titanic.age > 30
titanic['col2'] = titanic.deck.isna()
titanic['col3'] = titanic.age > 30 & titanic.deck.isna()
titanic['col4'] = (titanic.age > 30) & (titanic.deck.isna())
titanic['col5'] = (titanic.age > 30) | (titanic.deck.isna())
titanic['col6'] = ~(titanic.age > 30)
titanic['col7'] = ~(titanic.deck.isna())

titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,...,embark_town,alive,alone,col1,col2,col3,col4,col5,col6,col7
0,0,3,male,22.0,1,0,7.2500,S,Third,man,...,Southampton,no,False,False,True,True,False,True,True,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,...,Cherbourg,yes,False,True,False,True,False,True,False,True
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,...,Southampton,yes,True,False,True,True,False,True,True,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,...,Southampton,yes,False,True,False,True,False,True,False,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,...,Southampton,no,True,True,True,True,True,True,False,False

# Exercise
- ÏùºÏãúÏ†ïÏßÄ ÌõÑ Ïä§Ïä§Î°ú Î¨∏Ï†úÎ•º ÌíÄÏñ¥Î≥¥Í≥† Í∞ïÏùòÎ•º ÏàòÍ∞ïÌï¥ Ï£ºÏÑ∏Ïöî

1. Ïó∞ÏäµÎ¨∏Ï†ú: ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞ÏÖã ÌïÑÌÑ∞ÎßÅ
- Î¨∏Ï†ú:ÏïÑÎûòÎäî ÌÉÄÏù¥ÌÉÄÎãâ Ìò∏ ÏäπÍ∞ù Îç∞Ïù¥ÌÑ∞Ïóê ÎåÄÌïú Í∞ÑÎûµÌïú ÏÑ§Î™ÖÍ≥º Ìï®Íªò ÌïÑÌÑ∞ÎßÅ ÏûëÏóÖÏùÑ ÏàòÌñâÌïòÎäî Î¨∏Ï†úÏûÖÎãàÎã§. Seaborn ÎùºÏù¥Î∏åÎü¨Î¶¨Î•º ÏÇ¨Ïö©ÌïòÏó¨ ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞ÏÖãÏùÑ Î∂àÎü¨Ïò® ÌõÑ, Îã§Ïùå ÏûëÏóÖÏùÑ ÏàòÌñâÌïòÏÑ∏Ïöî.
  - classÍ∞Ä 'First'Ïù¥Í≥†, ageÍ∞Ä 30 Ïù¥ÏÉÅÏù∏ ÏäπÍ∞ùÎì§Ïùò Îç∞Ïù¥ÌÑ∞Î•º ÌïÑÌÑ∞ÎßÅÌïòÏÑ∏Ïöî.
  - survivedÍ∞Ä 1(ÏÉùÏ°¥)Ïù¥Í±∞ÎÇò embark_townÏù¥ 'Southampton'Ïù∏ ÏäπÍ∞ùÎì§Ïùò Îç∞Ïù¥ÌÑ∞Î•º ÌïÑÌÑ∞ÎßÅÌïòÏÑ∏Ïöî.
  - fareÍ∞Ä 100 Ïù¥ÏÉÅÏù¥Í≥†, sexÍ∞Ä 'female'Ïù∏ ÏäπÍ∞ùÎì§Ïùò Îç∞Ïù¥ÌÑ∞Î•º ÌïÑÌÑ∞ÎßÅÌïòÏÑ∏Ïöî.

In [42]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [55]:
#   - classÍ∞Ä 'First'Ïù¥Í≥†, ageÍ∞Ä 30 Ïù¥ÏÉÅÏù∏ ÏäπÍ∞ùÎì§Ïùò Îç∞Ïù¥ÌÑ∞Î•º ÌïÑÌÑ∞ÎßÅÌïòÏÑ∏Ïöî.

# con = (titanic['class'].isin(['First'])) & (titanic.age > 30)
filter1 = (titanic['class'] == 'First') & (titanic.age > 30)
sorted_df = pd.DataFrame(titanic[filter1])
sorted_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True

In [56]:
# - survivedÍ∞Ä 1(ÏÉùÏ°¥)Ïù¥Í±∞ÎÇò embark_townÏù¥ 'Southampton'Ïù∏ ÏäπÍ∞ùÎì§Ïùò Îç∞Ïù¥ÌÑ∞Î•º ÌïÑÌÑ∞ÎßÅÌïòÏÑ∏Ïöî.
filter2 = (titanic['survived'] == 1) | (titanic.embark_town == 'Southampton')
sorted_df = pd.DataFrame(titanic[filter2])
sorted_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [57]:
# - fareÍ∞Ä 100 Ïù¥ÏÉÅÏù¥Í≥†, sexÍ∞Ä 'female'Ïù∏ ÏäπÍ∞ùÎì§Ïùò Îç∞Ïù¥ÌÑ∞Î•º ÌïÑÌÑ∞ÎßÅÌïòÏÑ∏Ïöî.

filter3 = (titanic['fare'] >= 100) & (titanic['sex'] == 'female')
sorted_df = pd.DataFrame(titanic[filter3])
sorted_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
195,1,1,female,58.0,0,0,146.5208,C,First,woman,False,B,Cherbourg,yes,True
215,1,1,female,31.0,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True

---
-  üîí Ï†ÄÏûëÍ∂å Î∞è ÏÇ¨Ïö© Ï°∞Í±¥ (Ï§ëÏöî)
  - **Ï†ÄÏûëÍ∂å Î≥¥Ìò∏**: Ïù¥ Í∞ïÏùò ÎÖ∏Ìä∏Îäî Ï†ÄÏûëÍ∂åÎ≤ïÏóê ÏùòÌï¥ ÏóÑÍ≤©Ìûà Î≥¥Ìò∏Îê©ÎãàÎã§.
  - **Î¨¥Îã® ÏÇ¨Ïö© Í∏àÏßÄ**: Ïñ¥Îñ†Ìïú ÌòïÌÉúÎ°úÎì† ÏÉÅÏóÖÏ†Å ÏÇ¨Ïö©Ïù¥ ÏóÑÍ≤©Ìûà Í∏àÏßÄÎê©ÎãàÎã§.
  - **Í∞úÏù∏Ïö©ÎèÑ ÌïúÏ†ï**: Ïù¥ ÏûêÎ£åÎäî ÍµêÏú° Î™©Ï†ÅÏúºÎ°úÎßå ÏÇ¨Ïö©Ïù¥ ÌóàÍ∞ÄÎêòÎ©∞, Í∞úÏù∏Ï†ÅÏù∏ ÌïôÏäµ Ïô∏Ïùò Î™©Ï†ÅÏúºÎ°ú ÏÇ¨Ïö©Ìï† Ïàò ÏóÜÏäµÎãàÎã§.
  - **ÏúÑÎ∞ò Ïãú Ï°∞Ïπò**: Ï†ÄÏûëÍ∂åÎ≤ï ÏúÑÎ∞ò Ïãú Î≤ïÏ†Å Ï°∞ÏπòÍ∞Ä Ï∑®Ìï¥Ïßà Ïàò ÏûàÏäµÎãàÎã§.
---

<img src="https://i.ibb.co/1MPXBQZ/ringodata-banner-v2.jpg" width="200"/>